## Pandas

### Table of contents:
* [Import biblioteki](#0)
* [Exercise 151](#1)
* [Exercise 152](#2)
* [Exercise 153](#3)
* [Exercise 154](#4)
* [Exercise 155](#5)
* [Exercise 156](#6)
* [Exercise 157](#7)
* [Exercise 158](#8)
* [Exercise 159](#9)
* [Exercise 160](#10)

### <a name='0'></a> Import of libraries

In [ ]:
import numpy as np
import pandas as pd

np.random.seed(42)
np.__version__

'1.18.4'

### <a name='1'></a> Exercise 151
The following _DataFrame_ object is given:
```
df = pd.DataFrame(np.random.rand(10, 4), columns=list('ABCD'))
```

In [ ]:
df = pd.DataFrame(np.random.rand(10, 4), columns=list('ABCD'))
df

          A         B         C         D
0  0.374540  0.950714  0.731994  0.598658
1  0.156019  0.155995  0.058084  0.866176
2  0.601115  0.708073  0.020584  0.969910
3  0.832443  0.212339  0.181825  0.183405
4  0.304242  0.524756  0.431945  0.291229
5  0.611853  0.139494  0.292145  0.366362
6  0.456070  0.785176  0.199674  0.514234
7  0.592415  0.046450  0.607545  0.170524
8  0.065052  0.948886  0.965632  0.808397
9  0.304614  0.097672  0.684233  0.440152

Extract the rows of the _df_ object for which the _C_ column is greater than 0.8.

In [ ]:
df.loc[df['C'] > 0.8]

          A         B         C         D
8  0.065052  0.948886  0.965632  0.808397

### <a name='2'></a> Exercise 152
Extract the rows of the _df_ object for which the _C_ column is greater than 0.3 and the _D_ column is less than 0.7.

In [ ]:
df.loc[(df['C'] > 0.3) & (df['D'] < 0.7)]

          A         B         C         D
0  0.374540  0.950714  0.731994  0.598658
4  0.304242  0.524756  0.431945  0.291229
7  0.592415  0.046450  0.607545  0.170524
9  0.304614  0.097672  0.684233  0.440152

### <a name='3'></a> Exercise 153
Iterate through the first five rows of the _df_ object. Print each row to the console.

__Tip:__ Use the _pd.DataFrame.iterrows()_ function.

In [ ]:
for index, row in df.head().iterrows():
    print(row)

A    0.374540
B    0.950714
C    0.731994
D    0.598658
Name: 0, dtype: float64
A    0.156019
B    0.155995
C    0.058084
D    0.866176
Name: 1, dtype: float64
A    0.601115
B    0.708073
C    0.020584
D    0.969910
Name: 2, dtype: float64
A    0.832443
B    0.212339
C    0.181825
D    0.183405
Name: 3, dtype: float64
A    0.304242
B    0.524756
C    0.431945
D    0.291229
Name: 4, dtype: float64

### <a name='4'></a> Exercise 154
Set the value in row with index 3 for column B as _np.nan_.
Use _df.iloc_.

In [ ]:
df.iloc[3, 1] = np.nan

Set the value in the row at index 8 for column D as _np.nan_. Use _df.loc_.

In [ ]:
df.loc[8, 'D'] = np.nan

### <a name='5'></a> Exercise 155
Delete all rows from object _df_ containing missing values and assign to variable _df1_. Display variable _df1_.

In [ ]:
df1 = df.dropna()
df1

          A         B         C         D
0  0.374540  0.950714  0.731994  0.598658
1  0.156019  0.155995  0.058084  0.866176
2  0.601115  0.708073  0.020584  0.969910
4  0.304242  0.524756  0.431945  0.291229
5  0.611853  0.139494  0.292145  0.366362
6  0.456070  0.785176  0.199674  0.514234
7  0.592415  0.046450  0.607545  0.170524
9  0.304614  0.097672  0.684233  0.440152

### <a name='6'></a> Exercise 156
Note that the index after removing two rows in the _df1_ object is not in turn. Reset the index (do not add a new column, just reset the index). Display variable _df1_.

In [ ]:
df1 = df1.reset_index(drop=True)
df1

          A         B         C         D
0  0.374540  0.950714  0.731994  0.598658
1  0.156019  0.155995  0.058084  0.866176
2  0.601115  0.708073  0.020584  0.969910
3  0.304242  0.524756  0.431945  0.291229
4  0.611853  0.139494  0.292145  0.366362
5  0.456070  0.785176  0.199674  0.514234
6  0.592415  0.046450  0.607545  0.170524
7  0.304614  0.097672  0.684233  0.440152

### <a name='7'></a> Exercise 157
Let's go back to the _df_  object. Determine the number of missing elements in the _df_ object for each column.

In [ ]:
df.isnull().sum()

A    0
B    1
C    0
D    1
dtype: int64

### <a name='8'></a> Exercise 158
Fill in the missing values with the value 0 and assign to the variable _df_.

In [ ]:
df = df.fillna(0)
df

          A         B         C         D
0  0.374540  0.950714  0.731994  0.598658
1  0.156019  0.155995  0.058084  0.866176
2  0.601115  0.708073  0.020584  0.969910
3  0.832443  0.000000  0.181825  0.183405
4  0.304242  0.524756  0.431945  0.291229
5  0.611853  0.139494  0.292145  0.366362
6  0.456070  0.785176  0.199674  0.514234
7  0.592415  0.046450  0.607545  0.170524
8  0.065052  0.948886  0.965632  0.000000
9  0.304614  0.097672  0.684233  0.440152

### <a name='9'></a> Exercise 159
Replace the order of the columns in the _df_ object with the one given below:
* D, A, B, C

and assign to _df_.

In [ ]:
df = df[['D', 'A', 'B', 'C']]
df

          D         A         B         C
0  0.598658  0.374540  0.950714  0.731994
1  0.866176  0.156019  0.155995  0.058084
2  0.969910  0.601115  0.708073  0.020584
3  0.183405  0.832443  0.000000  0.181825
4  0.291229  0.304242  0.524756  0.431945
5  0.366362  0.611853  0.139494  0.292145
6  0.514234  0.456070  0.785176  0.199674
7  0.170524  0.592415  0.046450  0.607545
8  0.000000  0.065052  0.948886  0.965632
9  0.440152  0.304614  0.097672  0.684233

### <a name='10'></a> Exercise 160
Remove the $ D $ column from the _df_ object.

In [ ]:
# Solution 1
df.drop('D', axis=1)

          A         B         C
0  0.374540  0.950714  0.731994
1  0.156019  0.155995  0.058084
2  0.601115  0.708073  0.020584
3  0.832443  0.000000  0.181825
4  0.304242  0.524756  0.431945
5  0.611853  0.139494  0.292145
6  0.456070  0.785176  0.199674
7  0.592415  0.046450  0.607545
8  0.065052  0.948886  0.965632
9  0.304614  0.097672  0.684233

In [ ]:
# Solution 2
del df['D']
df

          A         B         C
0  0.374540  0.950714  0.731994
1  0.156019  0.155995  0.058084
2  0.601115  0.708073  0.020584
3  0.832443  0.000000  0.181825
4  0.304242  0.524756  0.431945
5  0.611853  0.139494  0.292145
6  0.456070  0.785176  0.199674
7  0.592415  0.046450  0.607545
8  0.065052  0.948886  0.965632
9  0.304614  0.097672  0.684233